{"name":"astrob","description":"Astro Blaster (version 3)","system":"mame","parentSystem":"segag80r","roms":["astrob"],"biosFiles":[],"hasSamples":true,"nativeResolution":[224,256],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"2"},"2":{"buttons":2,"type":"joy","ways":"2"}},"numberOfButtons":2,"buttonLabels":["Fire","Warp"],"alternating":true,"story":"A multi-wave colour raster shoot-em-up. Features include speech, a warp button that slows enemies, docking to refuel and secret bonuses. Two items must be monitored throughout the game the laser temperature since overheating renders ship unable to fire and a fuel gauge that, when depleted, ends the entire game even if you have ships remaining.\r\n\r\nThe game harbours many secret bonuses, some of which were mentioned in Tom Hershfield's book Mastering the VideoGames Bantam circa 1983, but others appear to be more elusive. The speech adds a great deal to the gameplay as it acts as your on-board computer.\r\n\r\nThe two-player mode is slightly unusual in that the players alternate between rounds rather than between ships a round is four or more waves plus a meteor/fireball wave plus a docking sequence. Hence, if player one does not survive round one then player two ends up playing alone!such as, shooting all enemies in a specific order or shooting all enemies without missing.\r\n\r\nYou control a ship at bottom of screen that shoots through waves of aliens, maneuvers through an asteroid belt and then docks with mother ship. Firing shots too fast causes the laser to overheat and become unoperational until it cools down. The warp button causes aliens and alien fire to slow down for timed duration. Fuel counts down while playing and if it runs out the game is over.\r\n\r\nThere are a couple of versions of this game in existence. The original ROM version had a different attract screen that did not contain any instructions. The waves were longer and the player was given the option of \"buying-in\" an extra number of ships, although the player was not allowed to buy extra fuel -- the main difficulty of the game.\r\n\r\nThis early release of Astro Blaster was practically imposisble to play because it was so difficult. The game was later modified to include instructions in the attract mode and the waves were shortened to reduce the overall difficulty. Even this later version is very challenging to the casual player and many seasoned players cannot even clear four out of the eight levels. To help players progress further, there exists a ROM hack that slows down fuel consumption and laser overheating.","genre":"Shoot-'Em-Up","manufacturer":"Sega","year":1981,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}