{"name":"darkseal","description":"Dark Seal (World revision 3)","system":"mame","parentSystem":"darkseal","roms":["darkseal"],"biosFiles":[],"hasSamples":false,"nativeResolution":[256,240],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"8"},"2":{"buttons":2,"type":"joy","ways":"8"}},"numberOfButtons":2,"buttonLabels":["Attack","Magic"],"alternating":false,"story":"According to an ancient legend of the Kingdom of Etrulia, should the people get corrupted by wickedness, demons and devils would break through the Gate of Doom, ruling the land as their own. However, by the same time four heroes with different powers would be summoned by the Force Divine to destroy the monsters of darkness and using the magic gem and magic crown they would try to lock the Gate of Doom forever.\r\n\r\nDark Seal was originally released in arcades in 1990. It is a beat'em-up in a fantasy set. One or two players (in co-op mode) can choose among 4 different characters: the Knight (who has a strong weapon), the Wizard (who has powerful magic), the Bard (who's immune to poison) and the Ninja (who has high-speed movement). The characters are viewed in an isometric perspective and can move and attack in all 8 directions, though they can't move while attacking.\r\n\r\nAll characters wield mid-range weapons. The Knight uses a morning star, the Wizard uses a magic flame pillar, the Bard uses an elastic spetum and the Ninja uses shurikens. They can also use magical attacks when a magic meter shown at the side of the screen is full. A book of spells keeps flipping its pages, showing a different spell in each page. Once the player hits the spell button, the spell showing in that moment in the book is activated, transforming him or her into different elemental forms (a tornado, a sparkling cloud, a bush of fire, etc.), lasting until the magic meter is depleted.\r\n\r\nThe enemies are typical fantasy ones, such as skeletons, ghouls, kobolds, etc. Some of them can poison or confuse the players. Throughout the game, chests can be found containing items can be collected to fill the characters life and magic meters, as well as items such as armor parts which can improve players stats.","genre":"Maze","manufacturer":"Data East Corporation","year":1990,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}