{"name":"ddragon2","description":"Double Dragon II - The Revenge (World)","system":"mame","parentSystem":"ddragon","roms":["ddragon2"],"biosFiles":[],"hasSamples":false,"nativeResolution":[256,240],"players":2,"controls":{"1":{"buttons":3,"type":"joy","ways":"8"},"2":{"buttons":3,"type":"joy","ways":"8"}},"numberOfButtons":3,"buttonLabels":["Attack Left","Jump","Attack Right"],"alternating":false,"story":"Following his defeat at the end of the original Double Dragon, Willy, the leader of the Black Warriors, retaliates against Billy and Jimmy Lee by murdering their friend, Marian, leaving the brothers with the task to avenge her death. \r\n \r\nThe sequel to Double Dragon is essentially an upgraded version of the original game, but with with a two-way attacking system similar to one previously used in Technos Japan's 1986 arcade game \"Renegade\". Many of the attacks and combos from the original \"Double Dragon\" are retained, as well as new techniques including the invincible Cyclone Kick. \r\n \r\nThe stages and weapons are redesigned versions of items previously featured in the original game. There are a few new traps such as a bulldozer in the middle of Mission 3 and all of the transition sequences between stages are now done with the character entering the next level via a lift, making it impossible to carry one weapon to the next area. \r\n \r\nMost of the enemy characters return from the original Double Dragon, with some given facelifts, but the stage bosses are all new. The enemies are as followed: \r\nWilliams - Has a wilder face and longer hair. He can now run towards the player and do cartwheels. He throws his knives in mid-air and sometimes carry a shovel which he throws towards the player. \r\nRowper - Has a beard and eye-patch, but otherwise is more or less identical to his original self. He carries shovels and can sometime pick up large objects. \r\nLinda - She now has a mohawk and face paint. She can also jump off platforms and do the elbow strike against the player. In addition to the ball and chain, she also carries grenades and knives. \r\nOharra - A strongman with a clean-shaved face. Replaces Abobo from the first game and has the same attacks. \r\nBolo - A head-swap of Oharra with long hair and beard. Replaces the mohawked head-swap of Abobo from the first game. \r\nJeff - Same as his original self, but now carries grenades. \r\nBurnov - The boss of Mission 1. An obese wrestler whose face is concealed with a mask. He grabs the player and throws similar punches in the face. After dying, he will stand up and yell, disappearing in front of the player and leaving only his clothes. In later encounters, he will revive himself at least once. \r\nAbore - The boss of Mission 2. A huge suspender-wearing strongman with Terminator-like sunglasses. His slaps and shoulder tackles do massive damage to the player. \r\nChin Taimei - The boss of Mission 3. A Chinese martial artists armed with twin kali sticks. In addition to his energy-draining stick combo, he also has a jump kick and sweep kick. \r\nWilly - The boss of Mission 4. Looks like he does in the original game, but now dresses in red. He still uses the same machine gun from the first game. \r\nThe clone - After defeating Willy, the player will have to fight their character's evil self. This clone has all the techniques the player has, but can also throw energy beams and possess the player's body to drain his energy.","genre":"Beat-'Em-Up","manufacturer":"Technos Japan","year":1988,"rating":"AAMA - Yellow (Animated Violence Mild)","mature":false,"crc":""}