{"name":"drmicro","description":"Dr. Micro","system":"mame","parentSystem":"drmicro","roms":["drmicro"],"biosFiles":[],"hasSamples":false,"nativeResolution":[224,256],"players":2,"controls":{"1":{"buttons":1,"type":"joy","ways":"4"},"2":{"buttons":1,"type":"joy","ways":"4"}},"story":"Dr. Micro is a platform game that was released by Sanritsu (in 1983); as with Dream Shopper, it runs on Namco's Pac-Man hardware (a Zilog Z80 running at 3.072 MHz), but with three Texas Instruments SN-76496s running at 4.608 MHz and one MSM-5205 running at 384 KHz for sound. The player must use a 4-way joystick to take control of an unnamed man who is on a mission to defeat an evil scientist (who is that eponymous \"Dr. Micro\") - and the first stage will see him making his way from one side of the screen to the other by dropping down onto vertically-moving platforms while firing shots at various enemies to kill them. A rubber life raft will magically follow your man's position on the screen so that if he falls off a platform, he will land in it, and be saved from falling into the ocean; once he has reached the second stage, he will have to fly around the screen on a beach ball, while killing as many enemies as he can. Once you have killed a certain number of enemies, the air vent at the top of the screen will open up, and the man will have to fly into it - and it is also worth noting that the ball he is sitting on will gradually deflate, so he will have to drop down to the bottom of the screen every time he needs to get another one. The third and final stage (which looks like it might have been based on the third stage of Donkey Kong Jr.) features a large amount of industrial machinery, that the man will have to watch out for; two robots will also be standing guard in front of Dr. Micro in his teleporter at the top of this stage, and they will both have to be killed before you can reach him. Once you kill him, the game will restart.","genre":"Platform","manufacturer":"Sanritsu","year":1983,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}