{"name":"footchmp","description":"Football Champ (World)","system":"mame","parentSystem":"taito_f2","roms":["footchmp"],"biosFiles":[],"hasSamples":false,"nativeResolution":[320,224],"players":4,"controls":{"1":{"buttons":2,"type":"joy","ways":"8"},"2":{"buttons":2,"type":"joy","ways":"8"},"3":{"buttons":2,"type":"joy","ways":"8"},"4":{"buttons":2,"type":"joy","ways":"8"}},"story":"Football Champ is an arcade-style football (soccer) video game. The game was produced by Team Dogyan developers in Japan, and originally released in the arcades by Taito in 1990.\r\n\r\nEuro Football Champ and Hat Trick Hero, released in 1992, are versions of this game with minor variations.\r\n\r\nSubsequent arcade releases of this game include Hat Trick Hero '93 (Japan) and Hat Trick Hero '95 (Japan, also released as Taito Power Goal).\r\nThe player must first choose one of eight national football teams, followed by a star player from a choice of four available for each team. In the game, a win is needed to progress to the next game. A draw will end as a 'game over', with no option for penalties, but a chance to continue by restarting the game in which a win was not achieved. Each opposition team is chosen according to a tier strategy, with the player's team removed:\r\n\r\n1. Spain and France.\r\n2. Netherlands and Brazil.\r\n3. England and Italy.\r\n4. Argentina and Germany.\r\nThus, playing with Germany, the first two games will be Spain and France in some order, the second two games will be Netherlands and Brazil in some order, the third two games will be England and Italy in some order, and the seventh game will be Argentina. The game is completed when all seven other teams have been beaten. The level of difficulty increases the further the game progresses. The game notices when individual team players score a hat trick. Scoring hat tricks has the effect of increasing the difficulty as well.\r\n\r\nThe game gained some notoriety for giving players the ability to use violence (including punches, flying kicks and shirt pulling). Players could get away with this without giving away a free kick as long as the referee was either far enough away or knocked onto the floor. The referee punishes every foul with a yellow card. Red cards occur at the third, seventh and eleventh fouls, although every so often the game appears to miscount. No fourth red card is given by the referee. Besides the rough play, the game introduced the super shot, which occurs with 30 seconds remaining or less and when the score is tied or the player is losing by 1 goal. The star player chosen kicks a shot that pushes the goalkeeper into the stands.\r\nSome versions of the game use Japan and USA (e.g. Hat Trick Hero) instead of Spain and France (e.g. Euro Football Champ).","genre":"Sports/Soccer","manufacturer":"Taito Corporation Japan","year":1990,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}