{"name":"omegaf","description":"Omega Fighter","system":"mame","parentSystem":"ninjakd2","roms":["omegaf"],"biosFiles":[],"hasSamples":false,"nativeResolution":[192,256],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"8"},"2":{"buttons":2,"type":"joy","ways":"8"}},"story":"Omega Fighter is a vertical scrolling shooter developed for the arcades by UPL in 1989. While similar to most shooters, Omega Fighter was unique in its gameplay, level and enemy focus: rather than flying over multiple levels, the player faced up against an enormous space battle cruiser which contained every level.\r\n\r\nTaking place in the future, an enormous alien battle cruiser/space craft carrier has attacked the Earth. The Earth's only defense lies in small fighter craft wielding great firepower with the mission of dismantling the cruiser one portion at a time before it lands.\r\n\r\nPlayers were briefed before every mission to destroy specific parts of the enormous ship. Destroying these parts of the ship would actually play some significance on the game's ending, but overall contributed to the player's score. The game has a unique scoring aspect that awarded the player for destroying enemies at point blank range.\r\n\r\nThere are two weapons that the player picks up, and if the player picks up a different powerup, it will always reset to its lowest level:\r\n\r\n(I) - Ion Laser: Shoots straight, pick up more to increase damage at a cost of decreasing length. Ideal for close combat.\r\n(W) - Wide Shot: Shoots bullets in wider range when collecting more of them. Ideal for taking enemies from afar but deals less damage.\r\nThere are also two items that are pressed by the 'bomb' button, and each player may pick up to two of them:\r\n\r\nSilver - Activate to slow down everything on screen. Useful to dodge bullets and getting closer for higher score.\r\nGold - Destroy all enemies on screen, score depends on closeness to player prior to using the item.","genre":"Shoot-'Em-Up","manufacturer":"UPL","year":1989,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":"c31cae56"}