{"name":"pitfight","description":"Pit Fighter (rev 9)","system":"mame","parentSystem":"atarig1","roms":["pitfight"],"biosFiles":[],"hasSamples":false,"nativeResolution":[336,240],"players":3,"controls":{"1":{"buttons":3,"type":"joy","ways":"8"},"2":{"buttons":3,"type":"joy","ways":"8"},"3":{"buttons":3,"type":"joy","ways":"8"}},"numberOfButtons":3,"buttonLabels":["Punch","Kick","Start / Jump"],"alternating":false,"story":"Pit-Fighter was produced by Atari Games in 1990.\r\n\r\nThe game has three different characters of whom each of the players can be: Buzz, an ex-professional wrestler Ty, a kick-boxing champion or Kato, a third-degree black belt. Each player character has different fighting styles and techniques and they also each have their own Super Moves. The opponents are The Executioner, Southside Jim, C.C. Rider, Chainman Eddie, Angel, Mad Miles, Heavy Metal and The Masked Warrior.\r\nYou must defeat all opponents in order to become the champion. The game has 15 different matches, some opponents like Southside Jim and Angel must each be faced twice in respective matches while other opponents are only faced once. Before you can make it to The Championship Match to face the reigning champion, The Masked Warrior, you must take on two Chainman Eddies. If only one player is in the game, there will only be one opponent at a time in most matches, but if two or three players are in, there will be two or three opponents at a time in each match.\r\n\r\nBetween every three matches, there is a Grudge Match where you will attempt to knock down your opponent three times without being knocked down three times yourself. If only one player is in the game, the opponent will be a computer-controlled clone of the character the player is controlling, but if two or three players are in the game, they will have to fight each other until the last of them remains standing. If the player wins the Grudge Match, a bonus is awarded. If not, no bonus.\r\n\r\nIn later matches, there are weapons and objects that can be used to fight against the opponents including knives, spiked balls, barrels, oil drums, crates, sticks, motorcycles, bar stools and so on. Those weapons and objects can also be used by the opponents, too. Also, on later stages, there are power pills that can temporarily make both the players and the opponents more powerful and more difficult to hurt.\r\n\r\nIf two or three players are in the game during the last match against the two Chainman Eddies before The Champioship Match, after they get past that one, they will have to fight each other until there is only one remaining to be standing because only one of them will proceed to The Championship Match. Once a player has made it to The Championship Match, the player must then face The Masked Warrior and then try to defeat him to win the championship. After this, the game ends. The attract mode music is generally considered to be annoying.","genre":"Fighter","manufacturer":"Atari Games","year":1990,"rating":"AAMA - Yellow (Life Like Violence Mild)","mature":false,"crc":""}