{"name":"quasar","description":"Quasar (set 1)","system":"mame","parentSystem":"quasar","roms":["quasar"],"biosFiles":[],"hasSamples":false,"nativeResolution":[240,223],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"2"},"2":{"buttons":2,"type":"joy","ways":"2"}},"numberOfButtons":2,"buttonLabels":["Fire","Forward"],"alternating":true,"story":"Quasar was produced by Zaccaria in 1980.\r\n\r\nQuasar is a space based shoot-em-up with four distinct phases of game-play.\r\n\r\nThe first phase is similar to Space Invaders, where UFOs appear at the top of the screen, and move towards the bottom while firing. Your space ship is confined to the bottom row, and fires vertically, with one bullet on screen at a time. The initial wave consists of 8 UFOs, but subsequent levels increase these to 16 UFOs.\r\n\r\nThe second phase has more in common with Asteroids. Your ship can move about the screen using the left, right and thrust buttons. Waves of two types of UFOs will cross the screen from either the left or the right, while firing at you. Your aim is to destroy all of the UFOs without being shot, and before an energy counter runs out. Any remaining energy is added to your score after completing the phase.\r\n\r\nIn the third phase, a quasar appears at the top of the screen, shining a tractor beam towards the bottom. When your ship is illuminated, it is drawn towards the quasar; otherwise it is repelled. The quasar randomly moves left and right, and the aim is to stay within the beam and eventually reach the quasar, before the tractor beam fades and while avoiding meteors. The speed of the tractor beam can be increased by shooting the eye of the quasar.\r\n\r\nIn the final phase, you are stuck in the centre of the screen while enemies come towards you, and you must rotate and fire at them before they collide with you. After this final phase, the game repeats from the first phase.","genre":"Shoot-'Em-Up","manufacturer":"Zaccaria / Zelco","year":1980,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}