{"name":"supbtime","description":"Super Burger Time (World, set 1)","system":"mame","parentSystem":"supbtime","roms":["supbtime"],"biosFiles":[],"hasSamples":false,"nativeResolution":[320,240],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"8"},"2":{"buttons":2,"type":"joy","ways":"8"}},"story":"The object of the game is to complete a number of hamburgers while avoiding enemy foods.\r\n\r\nWhen main protagonist, chef Peter Pepper, the player's character, walks the length of an ingredient (bun, meat patty, tomato, etc.), it falls one level. If it lands atop another ingredient, the latter in turn falls one level. A burger is completed when all vertically aligned ingredients have been dropped out of the maze and onto a waiting plate. Once all burgers are completed, the game level is finished.\r\n\r\nWhile making burgers, the player must avoid the antagonists, three types of enemies: Mr. Hot Dog, Mr. Pickle, and Mr. Egg. Enemies can be dodged, stunned, crushed with a falling ingredient, or dropped by luring them onto an ingredient and then causing it to fall. In this last case, the piece will fall two extra levels for every enemy caught on it. Enemies that have been crushed or dropped return to the maze after a few seconds. Dropped enemies award larger point values than crushed ones; therefore, to obtain a high score, the player must attract more than one enemy onto an ingredient just before dropping it.\r\n\r\nPeter Pepper has pepper shots to shake on nearby enemies to stun and render them harmless for a few seconds. Extra shots are obtained by collecting bonus foods, such as coffee, an ice cream cone, or French fries, which appear in the center of the maze when a certain number of ingredients have dropped.\r\n\r\nThere are six screens of increasing difficulty, with more burgers and enemies, burgers that have more parts, and/or layouts that make it easier for Peter Pepper to be cornered and harder for him to reach the ingredients. Completing all six screens takes the player back to the first one.","genre":"Platform","manufacturer":"Data East Corporation","year":1990,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}