{"name":"timber","description":"Timber","system":"mame","parentSystem":"mcr","roms":["timber"],"biosFiles":[],"hasSamples":false,"nativeResolution":[512,480],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"4"},"2":{"buttons":2,"type":"joy","ways":"4"}},"numberOfButtons":2,"buttonLabels":["Chop Left","Chop Right"],"alternating":false,"story":"You control a logger, who must chop down trees as they spring up. Two indicators appear at the top of the screen; the left tells you how many trees you must chop to clear the level, and the right tells you how much time you have left.\r\n\r\nThe boss is watching you, so you must chop down the trees quickly; to earn points for each tree, and bonus points for chopping all the trees needed for that level with time remaining. If a bird falls out of a tree you chop down, grabbing the bird before it gets away will earn you bonus points. You must avoid allowing a tree to fall on you; if it does, you will be stunned briefly, using up valuable time. A bear appears at a higher level, who will periodically throw beehives at you that releases bees, which you must avoid. A bonus level features maintaining your balance on a floating log that spins back and forth, which you must balance until the timer runs out to receive additional points.\r\n\r\nYou may play with a second player simultaneously, where you may either play cooperatively, or competitively. After chopping a tree before it falls (or after the other player chops the tree), it may be pushed down on the other player, instead of letting it fall down, if the player(s) choose to play competitively, The player with the higher tree count receives bonus points, and the other player is subjected to abuse from the boss.\r\n\r\nLevels become more difficult as you progress, with additional trees to cut down, and additional time added on the timer. A player loses a life if the logger gets hit by a beehive releasing bees that sting you, or if you fail to chop down all of the trees when the timer runs out (the boss will blow the whistle if this happens). The game is over when you lose all of your loggers.\r\n\r\nAfter every two levels is a bonus round where you must stay on a rolling log as long as possible.","genre":"Miscellaneous","manufacturer":"Bally Midway","year":1984,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}