{"name":"arabian","description":"Arabian","system":"mame","parentSystem":"arabian","roms":["arabian"],"biosFiles":[],"hasSamples":false,"nativeResolution":[234,256],"players":2,"controls":{"1":{"buttons":1,"type":"joy","ways":"8"},"2":{"buttons":1,"type":"joy","ways":"8"}},"numberOfButtons":1,"buttonLabels":["Kick"],"alternating":true,"story":"You play an adventurous Arabian prince and your goal is to rescue the princess from her palace. In your quest you will sail the seas, crawl in caves and fly magic carpets. Score points on the way for picking up the letters in \"A-R-A-B-I-A-N\" and get a bonus if they are collected in order.\r\n\r\nArabian is a \"Video book\" with a happy ending. The attract mode introduces the story, and animated storybook \"pages\" let you experience the Arabian Prince's adventures. Use the 8-way joystick to jump, super-jump, walk, crawl or climb in all directions. Tap the Kick button to boot your enemies out of the way.\r\n\r\nThe player controls a young Arabian Prince who must rescue his Princess from the castle tower where she is being held prisoner. Evil Genies in brass jugs that throw deadly smokeballs, swooping Rocs and purple ghostly creatures called Oscars will try to stop the hero along the way. Sometimes Rocs and Oscars will come together to form Super Rocs or Super Oscars who will be more dangerous, but these enemies are also worth a greater amount of points.\r\n\r\nThe Prince scores points for kicking Oscars or Rocs, picking up lettered jugs and spelling A-R-A-B-I-A-N. When The Prince picks up the jugs, he must only pick one up while a Genie is still inside or when a Genie is beginning to materialize. The Prince must not pick up a jug while a Genie is above it and fully-materialized or else he will die. The Prince loses a life when he gets hit by a smokeball thrown by a Genie, falls off either a ledge, flying carpet or vine, or gets caught touched by a Genie, Oscar, or Roc.","genre":"Platform","manufacturer":"Sun Electronics","year":1983,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}