{"name":"arbalest","description":"Arbalester","system":"mame","parentSystem":"seta","roms":["arbalest"],"biosFiles":[],"hasSamples":false,"nativeResolution":[224,384],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"8"},"2":{"buttons":2,"type":"joy","ways":"8"}},"numberOfButtons":2,"buttonLabels":["Fire","Special"],"alternating":false,"story":"Arbalester is a scrolling shoot 'em up arcade game released by SETA in 1989, licensed to Taito and Romstar. \r\n\r\nArbalester is a fast vertically scrolling top-down 2D shooter for one or two players simultaneously on the same screen. The player controls a plane through missions connected on a map. The plane always takes off from a base at the beginning of a stage and lands again at the end. The ship can be freely moved around there with an unlimited amount of bullets. It fires in bursts so tapping is needed. The weapon consists of regular projectiles along with ground attacks. This forces the plane to take risks and get up close in many occasions as the range to reach ground targets is limited. In every stage it is also possible to move a portion outside of the screen horizontally on both sides, making it scroll. This is sometimes useful to dodge bullets or avoid certain confrontations.\r\n\r\nDestroyed ships often leave behind power-ups to upgrade the main weapon. These stack and vastly improve the weapon through firing rate, damage, amount of bullets and eventually also a shooting pattern that covers a large part of the screen in many directions. Another power-up adds support ships that fire along. Additionally there are power-ups for special attacks such as a large plane that bombs the entire screen or a squadron of smaller planes firing at once. A single credit consists of three lives and all power-ups are lost when a life is taken after a single hit. There are mini-bosses and boss encounters. Certain levels have clouds where enemies pass under hiding their position.","genre":"Shoot-'Em-Up","manufacturer":"Seta","year":1989,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}