{"name":"armorcar","description":"Armored Car (set 1)","system":"mame","parentSystem":"galaxian","roms":["armorcar"],"biosFiles":[],"hasSamples":false,"nativeResolution":[224,768],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"4"},"2":{"buttons":2,"type":"joy","ways":"4"}},"numberOfButtons":2,"buttonLabels":["Sawhorse","2nd Gear"],"alternating":true,"story":"Overhead view of city streets that you drive a money van armoured car through as it scrolls from right to left. Some intersections are marked with directions. You pick up money to deliver to banks while avoiding criminals by dropping saw horses in roadway. Fuel levels must be replenished at gas stations along the way.\r\n\r\nArmored Car is an arcade racing game played from a top down perspective. The player drives the armored car through a network of streets and has to pick up money (shown as dollar signs) and deliver it to a bank. At the same time it is necessary to avoid robbers and other hazards that are easy to crash into. Some intersections have arrows that change every few second. The direction they are showing decides if the player can move forward or is forced to make a turn. It is possible to drop a sawhorse to go through an intersection and it can also be used to blow up a chasing robber. There is also an option to press the second gear button to speed away from a robber.\r\n\r\nThe car has an limited amount of fuel and it necessary to drive through a gas station before it runs out. In addition to the robbers there are some other vehicles on the streets such as steam rollers, street sweepers, ambulances and TNT trucks. Steam rollers change arrow intersections into sawhorses (which the player can pass through, but the robbers can not) while the street sweeper will remove arrows and sawhorses. Bonus points are given for crashing the TNT truck into a wall and for picking up keys that are then driven to locks.","genre":"Maze","manufacturer":"Stern Electronics","year":1981,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}