{"name":"bubbles","description":"Bubbles","system":"mame","parentSystem":"williams","roms":["bubbles"],"biosFiles":[],"hasSamples":false,"nativeResolution":[292,240],"players":1,"controls":{"1":{"type":"joy","ways":"8"}},"buttonLabels":[],"alternating":true,"story":"Your goal in Bubbles is to clear each level, by maneuvering a soap bubble in a sink, cleaning the sink of ants, crumbs, and grease splotches, called \"greasies\".\r\n\r\nEach ant, crumb and greasie earns points when collected, causing your soap bubble to grow in size, and form a face; a pair of eyes, a nose, then a mouth. The bubble continues to increase in size afterwards, as you grab crumbs, greasies and ants. Sponges and brushes will appear to absorb the crumbs, et al, taking the points away from you; they can be knocked away, but only once your bubble has a mouth, and will cause your bubble to shrink in size, along with losing some of your face. A cleaning lady will sometimes appear from the drain in the center of the sink, and sweep up the crumbs, etc. You must absorb the cleaning lady to receive the points she collected, but you must come in contact with her broom's bristles to get her broom.\r\n\r\nA cockroach will appear from the drain after a time (preceded by a loud sound) that will head right for your soap bubble, absorbing any ant, crumb, or greasie in the way. If it comes in contact with your bubble, you lose a life, unless you have the cleaning lady's broom, which you must have pointed directly at the cockroach in order to kill it, and makes the broom disappear. More cockroaches will appear if you don't clean the sink quickly. After the last ant, greasie or crumb is collected, the faucet at the top of the screen turns releasing water, the sink drains, and you earn bonus points based on the size of your bubble. The level may also be cleared if the sponge, brush, cleaning lady, or cockroach gets the last greasie, etc. or if the debris goes down the drain themselves.\r\n\r\nOther than the ways listed above, bonus points are earned by collecting ants, crumbs and greasies close to the drain, knocking sponges and brushes down the drain (when your bubble has a mouth), and jumping down the drain when the drain flashes green. Jumping down the drain skips a few levels, so you will reach the harder levels more quickly by doing this.\r\n\r\nAdditional ways of losing a life occur, when your bubble doesn't have a mouth: coming in contact with the brush or the sponge, by the level being cleared causing the sink to drain, or if you jump down the drain yourself. Coming in contact with the razor blades that appear in the sink in later levels are always fatal, so they must always be avoided. When you have lost all of your soap bubbles, the game is over.","genre":"Miscellaneous","manufacturer":"Williams","year":1982,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}