{"name":"fatfury3","description":"Fatal Fury 3 - Road to the Final Victory / Garou Densetsu 3 - haruka-naru tatakai (NGM-069)","system":"mame","parentSystem":"neogeo","roms":["fatfury3","neogeo"],"biosFiles":["neogeo"],"hasSamples":false,"nativeResolution":[320,224],"players":2,"controls":{"1":{"buttons":4,"type":"joy","ways":"8"},"2":{"buttons":4,"type":"joy","ways":"8"}},"story":"It has been two years since the second King Of Fighters tournament took place. Now Terry, Andy, Joe, Mai and Geese are back in South Town to battle five new characters and three bosses. All of them have their own reasons of coming to South Town, but in the end, everything links to a scroll that reveals the secret to the lost ancient martial arts.\r\n\r\nFatal Fury 3 was a pretty big improvement over its predecessors, introducing brand new re-drawn character sprites (yet again) and better overall animation quality. Of course, a handful of colorful new characters join the roster, in addition to some new 2D environments.\r\n\r\nThe two-plane gameplay was upgraded to a three plane format known as the Oversway System. Players fight primarily in the middle plane or the main plane, but can move or \"oversway\" into either of the sway lines at the background or foreground . Attacks between planes have returned but are now called \"Oversway Attacks\" and players can use special technique to defend these attacks. Other new gameplay elements introduced include air blocking, combination arts, new special & super moves, and even alternate (more powerful) super moves which can only be used once per round.\r\n\r\nAlong with a cool looking world map, Fatal Fury 3 also features a ranking system when fighting against the computer, which brought some innovation to the fighting genre. When the player wins a round, they'll be ranked from D to triple S. The final opponents the player faces at the end of the single player mode is determined the by the player's average... with a lower score, the game will end against Yamazaki, but with a higher score they will square off against one of the Jin twins, or possibly both. Overall, Fatal Fury 3 was easily the best presentation of the series to date.","genre":"Fighter","manufacturer":"SNK","year":1995,"rating":"AAMA - Red (Animated Violence Strong)","mature":false,"crc":""}