{"name":"hustler","description":"Video Hustler","system":"mame","parentSystem":"scobra","roms":["hustler"],"biosFiles":[],"hasSamples":false,"nativeResolution":[224,256],"players":2,"controls":{"1":{"buttons":1,"type":"joy","ways":"8"},"2":{"buttons":1,"type":"joy","ways":"8"}},"numberOfButtons":1,"buttonLabels":["Shoot"],"alternating":true,"story":"Video Hustler was the first billiards themed releases from Konami. More widely known by the names Lil' Video Hustler and Hustler, this arcade title features an overheard view of a pool table, but curiously, there are no pool sticks. There is no theme music to Video Hustler, but there are a couple of distinctive sound effects. Coming out in 1981, Konami is both the developer and the publisher for all arcade versions of Video Hustler.\r\n\r\nThere were no known ports for Video Hustler until rights were purchased by Microsoft in 2010. An updated version of Video Hustler is now featured on Xbox Live, which is an online platform where gamers can access this title if they are verified Microsoft customers. Although very basic, Video Hustler served as the inspiration for a few copycat titles as well as more sophisticated billiards video games released in the 1980s and the 1990s. Up to two players can play Video Hustler simultaneously, but alternating turns must be taken.\r\n\r\nVideo Hustler is a very simplistic arcade game. Levels are called patterns, and a small white marker is used to determine the angle of each shot. The objective is to get a high score. Only the five highest scores on any Video Hustler arcade machine were recorded.\r\n\r\nUsing the left, right, up and down keys, you must move this marker so that your invisible pool stick can strike the white cue ball and hit the colored balls. The idea is to get as many balls into the holes in as few shots as possible. At the start of every stage, six colored balls are racked and placed in the middle of the table. If you scratch the cue ball, that is, knock it into the pocket, you will lose a turn.\r\n\r\nScoring is based on a couple of factors. Each colored ball is numbered from one to six. Depending on the number of turns that it takes for you to complete a level, you will receive points based on the number etched on the cue ball that is multiplied by the 'bonus.'\r\n\r\nAdditionally, each pocket is assigned a multiplier. These values can shift and change according to the number of colored balls left on the table as well as angle of the last shot taken. Players are able to control the speed that the white cue ball travels by moving the angle marker. Parallel and horizontal shots always move faster than shots taken at awkward angles. The speed of the cue ball can also be increased when you attempt to hit a colored ball that is close by.","genre":"Sports/Pool and Dart","manufacturer":"Konami","year":1981,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}