{"name":"intrepid","description":"Intrepid (set 1)","system":"mame","parentSystem":"thepit","roms":["intrepid"],"biosFiles":[],"hasSamples":false,"nativeResolution":[224,256],"players":2,"controls":{"1":{"buttons":1,"type":"joy","ways":"8"},"2":{"buttons":1,"type":"joy","ways":"8"}},"story":"Intrepid is an arcade game that had been released by Nova Games in 1983; it utilizes two Zilog Z80 microprocessors running at 3.072 and 2.5 MHz, with two General Instrument AY-3-8910s running at 1.536 MHz for sound. The player must use a 4-way joystick to take up control of a secret agent (who is the eponymous \"Intrepid\") whose objective is to enter an embassy, find and retrieve a secret plan, then escape as fast as he can - and, to enter the embassy, you must press the game's single button to bring it down, then press it again to make its doors open and press it again to make Intrepid enter it. You shall then have to go up for each of the embassy's four floors in turn, and press the button to leave the elevator each time; when Intrepid stands in front of a door, push the joystick up to enter it. There are eight items that Intrepid must find by looking around the rooms these doors lead to which are all worth 300 points when collected: a key (which unlocks the locked door on the fourth floor), a combination (which is needed to open the locked door), an ID card (which allows Intrepid to bypass the embassy's security systems without electrocution), a disguise (this allows Intrepid to bypass the sentry, without getting recognized), an umbrella (which allows Intrepid to jump off the embassy roof without falling to his death), a wrench (which is to sabotage the elevator, and trap the guards at the bottom of its shaft), a map (which shows the locations of the remaining items) and a pair of running shoes (which allow Intrepid to move faster) - and, if Intrepid should fall down the elevator shaft, get caught by the guards, or get recognized by the sentry at the safe, he'll lose a life. Also, if he should jump off the roof before he's opened the safe (but after he's sabotaged the elevator), it is physically impossible for him to reenter the embassy; if this should happen, the bonus timer shall immediately decrease to 0 and cost him a life. Once Intrepid accomplishes his mission, he'll proceed to his next mission (which has more intelligent guards) - a sequel, Zarya Vostoka, was also released, in 1984.","genre":"Maze","manufacturer":"Nova Games Ltd.","year":1983,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}