{"name":"metrocrs","description":"Metro-Cross (set 1)","system":"mame","parentSystem":"baraduke","roms":["metrocrs"],"biosFiles":[],"hasSamples":false,"nativeResolution":[288,224],"players":2,"controls":{"1":{"buttons":1,"type":"joy","ways":"8"},"2":{"buttons":1,"type":"joy","ways":"8"}},"numberOfButtons":1,"buttonLabels":["Jump"],"alternating":true,"story":"Metro-Cross is a platform game released in arcades by Namco in 1985. It was ported to the Amstrad CPC, Atari ST, Commodore 64, Family Computer, and ZX Spectrum.\r\n\r\nMetro-Cross runs on Namco Pac-Land hardware, but with a video system modified to support a 2048-color palette like that used in Dragon Buster. It uses a Motorola M6809 microprocessor, with a Hitachi HD63701 sub-microprocessor (both running at 1.536 MHz) and Namco 8-channel waveform PSG for audio.\r\n\r\nThe player must take control of a man known only as Runner, who is given a time limit to run through each of the game's thirty-two rounds while avoiding obstacles and collecting drink cans. The actual running happens automatically: the job of the player is to avoid the obstacles and collect the cans by moving the Runner with the stick and adjusting his speed accordingly.\r\n\r\nIf the Runner finishes the round within the time limit, the remaining time will be awarded to him as bonus points and he will proceed to the next round. Every fourth round is special, using the remaining time from the three previous ones as additional time. However, if the Runner has not finished the round by the time the time limit runs out, he will be electrocuted and the game will immediately be over.\r\n\r\nObstacles along the way include Slip Zones which will slow the Runner down if he tries to cross over them, Pitfalls which will break under the Runner's weight and drop him into the holes beneath them, and Crackers which will launch the Runner up into the air and cause him to land on his back. Later rounds also feature Jumbo Tires that bounce towards the Runner, Walls that emerge from the ground before receding back into it, Cubes that move through particular columns of tiles, Mice that attempt to jump onto the Runner and slow him down, and Chess Knights and Kings that bounce from one tile to another.\r\n\r\nThe rounds also feature Springboards, which can be used to propel the Runner forward at a great speed. Some rounds have a special layout of Springboards, where it is possible to use one Springboard to land directly on the second one. Some other rounds also feature Skateboards which will speed the Runner up and make him immune to Slip Zones. There are also two different types of drink cans; kicking them will either gain the player bonus points (from 100 to 5000) or speed the Runner up, but jumping on them will stop the timer for a few seconds.","genre":"Platform","manufacturer":"Namco","year":1985,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}