{"name":"radrad","description":"Radical Radial","system":"mame","parentSystem":"seicross","roms":["radrad"],"biosFiles":[],"hasSamples":false,"nativeResolution":[256,224],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"8"},"2":{"buttons":2,"type":"joy","ways":"8"}},"numberOfButtons":1,"buttonLabels":["Shoot"],"alternating":true,"story":"Radical Radial, a simple little game but original and addictive devil if you like antiques.\r\n\r\nYou are directing not a ship, but ... a tire. Yes, a treadmill tire open on a rather congested road, you have a simple shot (two small shots in frontal), and you will have to go as far as possible. To survive, you have to dodge large cobblestones, either by steering or by jumping! Because yes, your tire is a jumper tire. And as much to say that mastering the jump is quite important, the layout of the obstacles is rather vicious in places.\r\n\r\nThe score also includes a little more for the time (yeah right now it has become usual): the enemies that attack by salvo will bring you points (obvious you will say), but you are already entitled to a score extension If you come to the end of the whole salvo! This is not always obvious given the speed of the game, because the speed of scrolling is surprising, especially in a 1982 production.\r\n\r\nThe game also includes passages of pure slalom, in which your shooting is disabled. These are also passages force-fed bonus but very challenging, the ballet of obstacles is very often Machiavellian to the pixel by (they crush everything on their way, ugly cars ...)\r\n\r\nIt's a 1982 game, so it's very basic visual question and sound, but the game is so fast and so stressful spent the first level that you do not pay attention.\r\n\r\nTo summarize the game, it can be said that it is a Moon Patrol in view from above, but much more speed.\r\n\r\nTry it, you will be surprised the addictive side of this game not so innocuous that it ...","genre":"Shooter","manufacturer":"Nichibutsu USA","year":1982,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}