{"name":"sbagman","description":"Super Bagman","system":"mame","parentSystem":"bagman","roms":["sbagman"],"biosFiles":[],"hasSamples":false,"nativeResolution":[224,256],"players":2,"controls":{"1":{"buttons":2,"type":"joy","ways":"4"},"2":{"buttons":2,"type":"joy","ways":"4"}},"numberOfButtons":1,"buttonLabels":["Action"],"alternating":true,"story":"Super Bagman was produced by French company Valadon Automation in 1984. The game was published under license by Stern Electronics in North America. \r\n\r\nYour character is a robber. Run around a mine collecting moneybags and depositing them in a wheelbarrow at the top of the screen. Climb ladders and ride elevators to avoid two angry miners. Grab pickaxes and other objects to temporarily stun your pursuers.\r\n\r\nThe character you control in this game is Bagman, an escaped convict in a stripped suit. His goal is to steal all the bags of gold from a mine, haul the gold to the surface and deposit his loot into his wheel-barrow. Bagman must avoid two cops who have been ordered to protect the mine, prevent the gold from being stolen and stop Bagman at all costs.\r\n\r\nUnlike the original game, this sequel has more variations. The mine has stairs that can be climbed down, an escalator to ride as well as an elevator. There is a Gunsmith's room with six-shot guns and bombs that Bagman can pick up and use. There is even another convict, Bagman's friend,locked in a dungeon in the mine which Bagman can free for an extra life.\r\n\r\nThe mine is three screens wide and scrolls as you move around. You must grab a bag of gold and carry it up to the surface and place it into the wheel-barrow before the bonus timer runs out. Whenever a bag of gold is being carried, Bagman will only walk half his normal speed, allowing the cops to easily catch up to him.\r\nSince evading the policemen is of primary importance, the following are some ways to actively disable your pursuers. If you are carrying a bag of gold while climbing a ladder, the bag can be dropped on the cop's head. Hitting a policeman with a pick-axe will stun him. Shooting the gun at or placing an exploding bomb next to a cop will also stop him for a few moments.\r\n\r\nAlternatively, passive techniques of avoiding the policemen can also be effective. The pick-axe can be used to dig a big hole in a wall or you can use a bomb to destroy the wall. Bagman can jump into or out of a mine cart by grabbing a handle on a tunnel roof as the cart passes underneath, but he must be careful to not come into contact with these carts in any other way, otherwise he will lose a life. The escalator or evelvator can also be used to elude the cops and, when transporting gold, will help Bagman reach the surface quicker.\r\n\r\nMost bags of gold are yellow, but there is a blue bonus bag that is behind a wall. The wall can only be penetrated by a pick-axe or a bomb. Even so, the bonus blue bag of gold is twice as heavy as the standard yellow bags of gold, but it is also worth a greater amount of points.\r\n\r\nIf you free the imprisoned convict from the dungeon in the mine using a pick-axe or a bomb, you will receive an extra life.\r\n\r\nThe game can be incredibly frustrating to play and suffers from some dubious collision detection. Speech: \"Good Work\", \"Ai Ai Ai!\", and some other unintelligible quote.","genre":"Platform","manufacturer":"Valadon Automation","year":1984,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}