{"name":"swimmer","description":"Swimmer (set 1)","system":"mame","parentSystem":"cclimber","roms":["swimmer"],"biosFiles":[],"hasSamples":false,"nativeResolution":[256,224],"players":2,"controls":{"1":{"buttons":1,"type":"joy","ways":"8"},"2":{"buttons":1,"type":"joy","ways":"8"}},"numberOfButtons":1,"buttonLabels":["Dive"],"alternating":true,"story":"Swimmer was produced by Tehkan in 1982.\r\n\r\nVenture up stream gathering fruits while avoiding various water-bound pests and obstacles. Eat power pills to attack critters.\r\n\r\nYou begin the game with three lives, and an extra life is awarded at 10,000 points. The game has four levels and on each one you must gather four kinds of fruit: strawberries, bananas, grapes and melons. Collecting four strawberries during each of the first three levels will yield a bonus of 1000 points. To get the maximum bonus on the fourth level, you must pick up four of the three other required fruits. Each required fruit is worth a different amount of points: strawberries, 100, 200, 300 and 400 points bananas, 200, 400, 600 and 800 points grapes, 300, 600, 900 and 1200 points and melons, 400, 800, 1200 and 1600 points. Other fruits that can be gathered for additional points include cherries, apricots, apples, plums, grapefruits, oranges, and pineapples. These have point values such as 50, 100, 150 and 200.\r\n\r\nThe first level has turtles, on the second there are crabs, on the third there are dragonflies and on the fourth there are fish. Use the joystick to move the swimmer around the river, and press the button to make the character dive under floating logs that may block the path of the river. The swimmer can also dive to avoid pests too.\r\n\r\nOn all but the first level, there are power pills that float downward along the river. If the swimmer catches one, he will gain temporarily invulnerability and each enemy that he eliminates will be worth 200 points.\r\n\r\nBefore you can get to the end of each of the first three levels, you must swim past a giant crab. Afterwards, there will be a short intermission that will tell you whether you earned a bonus or not. If you have four strawberries, a treasure chest will open and it will say \"Bonus! 1000 points\". If not, the treasure chest will remain closed, and it will say \"No Bonus\". When you reach the fourth level, it will be a non-moving screen with a set of six rocks standing in the water. These won't do you any harm, but you won't be able to dive under them. Five fish will approach you, but only three will pursue you. The swimmer will need to continue to pick up power pills in order to kill the fish.\r\n\r\nAfter the fourth level has been completed, there will be a special intermission where the character will swim towards an island where he will set foot upon the beach and stand triumphant. A message will say \"Well Done! You Are Great!\". This is followed by another intermission where you will receive a bonus score for all four levels completed. You will need all four of the other three required fruits in order to open all four bonus treasure chests. The first one is 1000 points, the second is 2000 points, the third is 3000 points and the fourth is 4000 points. After these intermissions, the levels begin again, but with an increased difficulty.","genre":"Sports","manufacturer":"Tehkan","year":1982,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}