{"name":"zookeep","description":"Zoo Keeper (set 1)","system":"mame","parentSystem":"qix","roms":["zookeep"],"biosFiles":[],"hasSamples":false,"nativeResolution":[256,256],"players":2,"controls":{"1":{"buttons":1,"type":"joy","ways":"4"},"2":{"buttons":1,"type":"joy","ways":"4"}},"numberOfButtons":1,"buttonLabels":["Jump"],"alternating":true,"story":"You control Zeke the zookeeper who must rescue his girlfriend Zelda from the Zoo. There are four levels or \"adventures\". Each level has its own task such as trapping the animals in the zoo, jumping ledges up the screen and jumping animals to earn a bonus keeper.\r\n\r\nDuring the first part of the game, you move Zeke around to build a wall around the Zoo. He must jump to avoid any of the wild animals that are loose. Special items will appear on this level when the fuse-like timer at the top of the screen reaches that part. If the timer makes it to the word \"End\", the current level ends and the game proceeds on to the next. The bonus items that occasionally appear on the screen include mugs of root beer, ice cream sundaes, clover clubs, watermelons, etc.\r\nWhen the timer reaches a net, one will appear at a certain location on the wall and if Zeke picks it up, he will be able to capture the animals on the loose and put them back into the Zoo. The net will eventually disappear and the captured animals will try to escape from the Zoo by eating through the wall. Zeke will have to continue building the wall around the Zoo until time is up. At the end of that level, bonus points are awarded for every animal captured. The animals found on this level are snakes, moose, camels, rhinos, elephants and a lion.\r\n\r\nOn the second level, Zelda is tied to a palm tree and Zeke must rescue her by jumping upwards from level to level while dodging coconuts thrown by a mischievous little monkey. On each of the ledges there are various foods and drinks that Zeke can collect for extra points. Sometimes, one of the ledges will even have a \"Free Game\" sign that will grant you a free credit. While Zelda is tied up, she says \"Save Me!\" and whenever Zeke gets knocked out by one of the deadly coconuts, she says \"Oh, No!\" If Zeke makes it all the way to the top and rescues her, she says \"My Hero!\" and a bonus of 5,000 points is awarded.\r\n\r\nThe third level is the same as the first, but on the fourth level, Zeke must constantly jump over herds of charging animals that come out of the cages at the end of each escalator. Zeke then rides the escalator to get to the next floor. Zeke must get to second escalator to reach the top floor where Zelda is, to rescue her. After Zeke has rescued Zelda on the fourth level, the game begins again with an increased difficulty.","genre":"Platform","manufacturer":"Taito America Corporation","year":1982,"rating":"AAMA - Green (Suitable For All Ages)","mature":false,"crc":""}